// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

int a = 4;
int b = 8;
int c= 12;
int max;


 if(a>b)  { 


if(a>c) {  
 max=a;
Console.WriteLine(max);
 }

 }
  else
  {
if(b>c)  { 
 max=b;

Console.WriteLine(max);

 } 
 else
 {   
 max=c;
Console.WriteLine(max);  }

 }


