//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
Console.WriteLine("Vvedite chislo x  ");
int x = int.Parse(Console.ReadLine());


if(x%2==0) {


Console.WriteLine("chislo chetnoe" +" "+  x ); 

}

else

{

   Console.WriteLine("chislo ne chetnoe"); 
}
