//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int x = 5 ;

if ( x%2==0)  {


Console.WriteLine(x); 


}

